html/SQLServer/e-security.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-01-22 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>User/Permission</title>
<meta name="generator" content="Org mode">
<meta name="author" content="孙悟空">
<link rel='stylesheet' href='/html/asset/common.css?3344' />
<link rel='stylesheet' href='/yaoliusan/html/asset/common.css?3344' />

</head>
<body>
<div id="content">
<header>
<h1 class="title">User/Permission</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org97e40f6">1. Login 登录名 (sa)</a></li>
<li><a href="#org9fb319c">2. User 用户 (dbo/guest)</a></li>
<li><a href="#orgd3b8afc">3. Permission 权限 (select/insert/update/&#x2026;)</a></li>
<li><a href="#orge6a7a53">4. Role 角色 (db_owner)</a></li>
</ul>
</div>
</nav>



<section id="outline-container-org97e40f6" class="outline-2">
<h2 id="org97e40f6"><span class="section-number-2">1</span> Login 登录名 (sa)</h2>
<div class="outline-text-2" id="text-1">
<p>
拿来进行登录 sqlserver 的。
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">create</span> login wodedengluming <span style="color: #c678dd; font-weight: bold;">with</span> password = <span style="color: #98be65;">'nishishui'</span>;
<span style="color: #c678dd; font-weight: bold;">drop</span> login wodedengluming;
</pre>
</div>

<p>
新创建的登录名 (login) 是没有任何操作数据库的权利的。
</p>

<p>
必须要为 login 在不同的数据库上绑定 user 它才可能有相关的权利。
</p>
</div>
</section>

<section id="outline-container-org9fb319c" class="outline-2">
<h2 id="org9fb319c"><span class="section-number-2">2</span> User 用户 (dbo/guest)</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-sql">use oa;
<span style="color: #c678dd; font-weight: bold;">create</span> <span style="color: #61afef; font-weight: bold;">user</span> aabc <span style="color: #c678dd; font-weight: bold;">for</span> wodedengluming; <span style="color: #687080; font-style: italic;">-- &#22312; oa &#19978;&#20026; wodedengluming &#38468;&#21152;&#19968;&#20010;&#29992;&#25143;</span>
</pre>
</div>

<p>
虽然默认的用户是没有任何权利的，但是我们可以为它赋予权限和角色呀!
</p>

<p>
也就是说，用户 (user) 是权限和角色的载体。
</p>
</div>
</section>

<section id="outline-container-orgd3b8afc" class="outline-2">
<h2 id="orgd3b8afc"><span class="section-number-2">3</span> Permission 权限 (select/insert/update/&#x2026;)</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-sql">use oa;
<span style="color: #c678dd; font-weight: bold;">grant</span> <span style="color: #c678dd; font-weight: bold;">select</span> <span style="color: #c678dd; font-weight: bold;">on</span> emp <span style="color: #c678dd; font-weight: bold;">to</span> aabc; <span style="color: #687080; font-style: italic;">-- &#25480;&#26435;&#35821;&#21477;</span>
<span style="color: #c678dd; font-weight: bold;">grant</span> <span style="color: #c678dd; font-weight: bold;">delete</span> <span style="color: #c678dd; font-weight: bold;">on</span> emp <span style="color: #c678dd; font-weight: bold;">to</span> aabc; <span style="color: #687080; font-style: italic;">-- &#25480;&#26435;&#35821;&#21477;</span>

<span style="color: #687080; font-style: italic;">-- &#25764;&#38144;</span>
<span style="color: #c678dd; font-weight: bold;">revoke</span> <span style="color: #c678dd; font-weight: bold;">delete</span> <span style="color: #c678dd; font-weight: bold;">on</span> emp <span style="color: #c678dd; font-weight: bold;">from</span> aabc;
</pre>
</div>
</div>
</section>

<section id="outline-container-orge6a7a53" class="outline-2">
<h2 id="orge6a7a53"><span class="section-number-2">4</span> Role 角色 (db_owner)</h2>
<div class="outline-text-2" id="text-4">
<p>
将各种权限打包，起个名字，便于使用。
</p>

<div class="org-src-container">
<pre class="src src-sql"><span style="color: #c678dd; font-weight: bold;">exec</span> sp_addrolemember <span style="color: #98be65;">'db_owner'</span>, <span style="color: #98be65;">'aabc'</span>
</pre>
</div>
</div>
</section>
</div>
<div id="postamble" class="status">
<p class="author">Author: 孙悟空</p>
<p class="date">Created: 2021-01-22</p>
<p class="validation">Go ahead, never stop.</p>
</div>
</body>
</html>
